create database AvicultureData;

Use AvicultureData


/*_____________________________جدول ها____________________________________*/

Create table City(name nvarchar(50),cityId INT IDENTITY(1,1) PRIMARY KEY)
Create table Employer(name nvarchar(50) , lastname nvarchar(50), pass nvarchar(50) , age int,gender nvarchar(50),telephone nvarchar(50),homeAddress nvarchar(200),EmployerId nvarchar(50),CityId int);

Create table Building(name nvarchar(50),telephone nvarchar(50) , PlaceAddress nvarchar(200) ,CityId int,BuildingtypeId int,CurrentCapacity int,MaxCapacity int,BuildingId INT IDENTITY(1,1) PRIMARY KEY);
Create table BuildingType(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)

Create table Hen(BirthHistory nvarchar(50) ,HenTypeId int,HouseId int,UsageTypeId int,HenWeight float,HenStatusId int,HenId INT IDENTITY(1,1) PRIMARY KEY);
Create table Cart(ItemTypeId int ,Number float,OperationId int,DoneHistory nvarchar(50),BarnId int)

Create table Unit(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)
Create table Item(name nvarchar(50),UnitId int,CapacityUsage int,Itemtype int,Id INT IDENTITY(1,1)  PRIMARY KEY)
Create table ItemType(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)
Create table Operation(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)

Create table HenType(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)
Create table HenStatus(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)
Create table HenUsageType(name nvarchar(50),Id INT IDENTITY(1,1) PRIMARY KEY)


/*_______________________مقدار دهی___________________*/

Insert Into BuildingType Values(N'مرغداری')
Insert Into BuildingType Values(N'انبار')




Insert Into HenType Values(N'رسمی')
Insert Into HenType Values(N'محلی')

exec Add_HenType N'رسمی'
exec Add_HenType N'محلی'


Insert Into HenStatus Values(N'سالم')
Insert Into HenStatus Values(N'مریض')

exec Add_HenStatus N'سالم'
exec Add_HenStatus N'مریض'


Insert Into HenUsageType Values(N'گوشت')
Insert Into HenUsageType Values(N'تخم مرغ')

exec Add_HenUsageType N'گوشت'
exec Add_HenUsageType N'تخم مرغ'



/*__________________________________________*/


Insert Into ItemType Values(N'غلات')	
Insert Into ItemType Values(N'ابزار')	
Insert Into ItemType Values(N'مایعات')	

Insert Into Item Values(N'گندم' ,1,10,1)
Insert Into Item Values(N'برنج' ,1,75,1)
Insert Into Item Values(N'ذرت' ,1,50,1)
Insert Into Item Values(N'جو' ,1,120,1)
Insert Into Item Values(N'آب' ,2,120,3) 	

Insert Into Item Values(N'آسیاب میکسر و بالابر',3,6,2)
Insert Into Item Values(N'انتقال دان',3,5,2)
Insert Into Item Values(N'اینلت',3,25,2)
Insert Into Item Values(N'آبخوری',3,5,2)
Insert Into Item Values(N'پد کولینگ',3,50,2)
Insert Into Item Values(N'تابلو برق',3,1,2)
Insert Into Item Values(N'جت هیتر',3,1,2)
Insert Into Item Values(N'دانخوری',3,1,2)
Insert Into Item Values(N'مه پاش',3,1,2)
Insert Into Item Values(N'هواکش',3,1,2)
Insert Into Item Values(N'هیتر کابینتی',3,1,2)
Insert Into Item Values(N'قفس',3,5,2) 

 
Insert Into Unit Values(N'کیلوگرم')	
Insert Into Unit Values(N'لیتر')	
Insert Into Unit Values(N'عدد')	

	 

Insert Into City Values(N'آذربایجان شرقی' )
Insert Into City Values(N'اصفهان')
Insert Into City Values(N'البرز')
Insert Into City Values(N'ایلام')
Insert Into City Values(N'بوشهر')
Insert Into City Values(N'تهران')
Insert Into City Values(N'چهارمحال و بختیاری' )
Insert Into City Values(N'خراسان جنوبی')
Insert Into City Values(N'خراسان رضوی')
Insert Into City Values(N'خراسان شمالی')
Insert Into City Values(N'خوزستان')
Insert Into City Values(N'زنجان')
Insert Into City Values(N'سمنان')
Insert Into City Values(N'سیستان و بلوچستان')
Insert Into City Values(N'فارس')
Insert Into City Values(N'قزوین')
Insert Into City Values(N'قم')
Insert Into City Values(N'کردستان')
Insert Into City Values(N'کرمان')
Insert Into City Values(N'کرمانشاه')
Insert Into City Values(N'کهگیلویه و بویراحمد')
Insert Into City Values(N'گلستان')
Insert Into City Values(N'گیلان')
Insert Into City Values(N'لرستان')
Insert Into City Values(N'مازندران')
Insert Into City Values(N'مرکزی')
Insert Into City Values(N'هرمزگان')
Insert Into City Values(N'همدان')
Insert Into City Values(N'یزد')


Insert Into Building Values(N'ابريشم',56541090,N'شور آباد   بين  خيابان  اول  و دوم',1,2,0,958)
Insert Into Building Values(N'آرمين ',56541090,N'جاده قديم قم بعد از شورآباد روبروي مهدي آباد خ يکم شرقي هفتمين چهارراه دست راست اخرين بنگاه ',1,1,0,316)
Insert Into Building Values(N'احمد کريمي',55300555,N'ضلع شمال شرقي ترمينال جنوب  بعداز مسجد اقدس اولين خ دست چپ-شهيد رسول عالي پلاک 56',1,2,0,413)
Insert Into Building Values(N'احمديه ',56545862,N'شصت متري شورآباد  سي متري سوم جنوبي ',1,1,0,491)
Insert Into Building Values(N'اطلس',55303628,N'روبه روي بهشت زهراء  خيابان رجايي  جنب مسجد مادر',1,1,0,914)
Insert Into Building Values(N'اعتماد',55228102,N'ابتداي جاده قديم قم  خ ترانسفور کوچه دوم پلاک 8  ',1,1,0,679)
Insert Into Building Values(N'افق شرق',33477256,N'سه راه افسريه شهرک مسعوديه  20متري شيرازي جنب بنگاه عقدايي پلاک 831',1,1,0,952)
Insert Into Building Values(N'خاوران/تقي پور',33450157,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد',1,2,0,294)
Insert Into Building Values(N'خاوران/ صالحي',33461102,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,927)
Insert Into Building Values(N'خاوران /عسگري',33879511,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,675)
Insert Into Building Values(N'بيزن ',33749246,N'فداييان اسلام  پايين ترازپل سيمان  خ ابن بابويه پهارراه پشمه علي  بعداز خ ابوذر جنب پمپ گاز پلاک8',1,2,0,931)
Insert Into Building Values(N'پارس',55060644,N'بعداز پل بعثت خ شهرزاد 20متري وفا پلاک 515',1,1,0,862)
Insert Into Building Values(N'تعاون ',55228025,N'خيابان ترانسفوت کوچه 4  پلاک 10',1,2,0,635)
Insert Into Building Values(N'تعاوني ',55228025,N'خيابان ترانسفورت  کوچه3 پلاک 14',1,1,0,887)
Insert Into Building Values(N'تهران دز',33742085,N'خ فداييان اسلام جنوبي جنب چيت ممتاز کوچه مختاري ',1,1,0,153)
Insert Into Building Values(N'جاويد',55228105,N'جاده قديم قم  خيابان ترانسفو گوچه دوم',1,1,0,860)
Insert Into Building Values(N'خالقي ',33747322,N'خ سوم دولت اباد-بالاتراز ميدان دولت اباد-دست راست خ قدس  روبروي مسجد سيدالشهداء پلاک 3',1,2,0,601)
Insert Into Building Values(N'داوري ',55009092,N'اول اتوبان بهشت زهراء بعداز پل صنيع خاني صالح آباد غربي خ کلهر پ 68',1,1,0,207)
Insert Into Building Values(N'رضايي و شرکاء',56527785,N'خ چمران 300متر داخل خيابان ',1,2,0,463)
Insert Into Building Values(N'رنجبر',55215799,N'جاده قديم قم بعداز سه راهي پالايشگاه خ شهرسنک خ 15 پلاک 18',1,1,0,341)
Insert Into Building Values(N'زرين بهار',33741400,N'ميدان شوش دولت اباد بلوار شهرزاد روبروي پمپ بنزين کيا ',1,2,0,182)
Insert Into Building Values(N'سپهر',56545712,N'شصت متري شورآباد خ ششم شمالي دست چپ درب سبز رنگ پلاک 6',1,2,0,475)
Insert Into Building Values(N'ستوده ',33862882,N'سه راه افسريه خ خاوران گردنه تنباکويي روبروي مصالح شهرداري ',1,1,0,694)
Insert Into Building Values(N'سلام ',55218900,N'خ شهيد رجايي خ شهرسنگ روبروي فرعي دوم ',1,2,0,643)
Insert Into Building Values(N'سهند',56540122,N'شصت متري شورآباد 30متري ششم جنوبي ',1,1,0,658)
Insert Into Building Values(N'سهيل ',33399392,N'خ فداييان اسلام بعداز کمربندي آزادگان پايين تر از پمپ بنزين داخل باربري دليجان اميد ',1,1,0,869)
Insert Into Building Values(N'سوگند',55062473,N'خ فداييان اسلام بعداز پل بعثت ايستگاه ميهن ',1,2,0,828)
Insert Into Building Values(N'صدرا',56530445,N'جاده واوان نرسيده به پل اتوبان قم دست چپ مجتمع آزادگان ',1,2,0,506)
Insert Into Building Values(N'طايران ',56540735,N'اول جاده قديم قم بعداز شورآباد مهدي آباد جنب بانک رفاه خ يکم شرقي  4راه چهارم ',1,1,0,598)
Insert Into Building Values(N'عالم شکن ',55188412,N'خ فداييان اسلام نرسيده به اتوبان آزادگان ايستگاه عوارضي کوچه مهرگان پلاک 18جديد',1,2,0,584)
Insert Into Building Values(N'عدل آرام ',55527517,N'خ رجايي بعداز 13آبان نرسيده به بيمارستان 7تير خ امامزاده ابوالحسن ',1,2,0,407)
Insert Into Building Values(N'عدل صالح ',33876495,N'جاده خاوران بعداز ميدان آقانور روبروي بازار مصالح ',1,2,0,298)
Insert Into Building Values(N'عدل عليزاده ',33408900,N'خ فداييان اسلام اول جاده ورامين سه راه تقي آباد ابتداي خيابان امين آباد خ عرب خواري پلاک 16',1,2,0,971)
Insert Into Building Values(N'عرب ',56546190,N'جاده قديم شورآباد خ شهيد مدني جنب 4راه 22بهمن پلاک 32',1,1,0,746)
Insert Into Building Values(N'عرفان ',55215323,N'جاده قديم قم مقابل اسياب قرمز انبار عرفان ',1,1,0,192)
Insert Into Building Values(N'عسگري ',33877222,N'سه راه افسريه اول خيابان مظاهر انبار چاي',1,2,0,221)
Insert Into Building Values(N'علي ',33753161,N'خيابان فداييان اسلام نرسيده به پل سيمان کوچه سرزعيم ',1,2,0,953)
Insert Into Building Values(N'فتح المبين 1',55202201,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي اول  ',1,1,0,880)
Insert Into Building Values(N'فتح المبين 2',55207191,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي  سوم  ',1,1,0,605)
Insert Into Building Values(N'فجر',55207000,N'جاده قديم قم شهر سنگ جنب شرکت سايپا پرس پلاک 40 ',1,1,0,344)
Insert Into Building Values(N'فرديس',33398897,N'ابتداي جاده قديم قم بعداز سه راهي بهشتي خ ايران ترانسفو فرعي سوم پلاک 22',1,2,0,772)
Insert Into Building Values(N'فرشاد',33765926,N'خ فداييان اسلام نرسيده به پل سيمان  خ شهيد غيبي پلاک 12',1,1,0,931)
Insert Into Building Values(N'قائم ',55188677,N'خيابان فداييان اسلام بلوار ابريشم خ ياس پلاک 13',1,2,0,330)
Insert Into Building Values(N'گودير',66807730,N'صفادشت شهرک صنعتي صفادشت خ ششم غربي بعداز ميدان تقاطع دوم ',1,1,0,805)
Insert Into Building Values(N'مجتبي',56541468,N'شصت متري شورآبادبعداز خيابان پنجم جنوبي دست راست پلاک 110',1,1,0,808)
Insert Into Building Values(N'محسن ',55004916,N'خيابان فداييان اسلام پشت پمپ بنزين زهره بند جنب باشگاه پورا پلاک 42',1,1,0,890)
Insert Into Building Values(N'محمد',33822260,N'سه راه افسريه اول خيابان مظاهر داخل انبار چاي',1,1,0,178)
Insert Into Building Values(N'مهديه ',33371618,N'اول دولت اباد بلوار قدس پلاک 226 ',1,2,0,340)
Insert Into Building Values(N'مهرفرهاد',33860715,N'گردنه تنباکويي بالاتر از انبار مصالح شهرداري ',1,2,0,307)
Insert Into Building Values(N'نقش جهان ',55202723,N'جاده قديم قم بعداز سه راه ترانسفو کوچه آسياب قرمز',1,2,0,793)
Insert Into Building Values(N'هجرت ',33867304,N'سه راه افسريه خ 20متري شرکت واحد  پلاک 4',1,1,0,332)



Insert Into Building Values(N'ابريشم',56541090,N'شور آباد   بين  خيابان  اول  و دوم',1,2,0,958)
Insert Into Building Values( N'آرمين ',56541090,N'جاده قديم قم بعد از شورآباد روبروي مهدي آباد خ يکم شرقي هفتمين چهارراه دست راست اخرين بنگاه ',1,1,0,316)
Insert Into Building Values( N'احمد کريمي',55300555,N'ضلع شمال شرقي ترمينال جنوب  بعداز مسجد اقدس اولين خ دست چپ-شهيد رسول عالي پلاک 56',1,2,0,413)
Insert Into Building Values( N'احمديه ',56545862,N'شصت متري شورآباد  سي متري سوم جنوبي ',1,1,0,491)
Insert Into Building Values( N'اطلس',55303628,N'روبه روي بهشت زهراء  خيابان رجايي  جنب مسجد مادر',1,1,0,914)
Insert Into Building Values( N'اعتماد',55228102,N'ابتداي جاده قديم قم  خ ترانسفور کوچه دوم پلاک 8  ',1,1,0,679)
Insert Into Building Values( N'افق شرق',33477256,N'سه راه افسريه شهرک مسعوديه  20متري شيرازي جنب بنگاه عقدايي پلاک 831',1,1,0,952)
Insert Into Building Values(N'خاوران/تقي پور',33450157,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد',1,2,0,294)
Insert Into Building Values(N'خاوران/ صالحي',33461102,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,927)
Insert Into Building Values(N'خاوران /عسگري',33879511,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,675)
Insert Into Building Values(N'بيزن ',33749246,N'فداييان اسلام  پايين ترازپل سيمان  خ ابن بابويه پهارراه پشمه علي  بعداز خ ابوذر جنب پمپ گاز پلاک8',1,2,0,931)
Insert Into Building Values(N'پارس',55060644,N'بعداز پل بعثت خ شهرزاد 20متري وفا پلاک 515',1,1,0,862)
Insert Into Building Values(N'تعاون ',55228025,N'خيابان ترانسفوت کوچه 4  پلاک 10',1,2,0,635)
Insert Into Building Values(N'تعاوني ',55228025,N'خيابان ترانسفورت  کوچه3 پلاک 14',1,1,0,887)
Insert Into Building Values(N'تهران دز',33742085,N'خ فداييان اسلام جنوبي جنب چيت ممتاز کوچه مختاري ',1,1,0,153)
Insert Into Building Values(N'جاويد',55228105,N'جاده قديم قم  خيابان ترانسفو گوچه دوم',1,1,0,860)
Insert Into Building Values(N'خالقي ',33747322,N'خ سوم دولت اباد-بالاتراز ميدان دولت اباد-دست راست خ قدس  روبروي مسجد سيدالشهداء پلاک 3',1,2,0,601)
Insert Into Building Values(N'داوري ',55009092,N'اول اتوبان بهشت زهراء بعداز پل صنيع خاني صالح آباد غربي خ کلهر پ 68',1,1,0,207)
Insert Into Building Values(N'رضايي و شرکاء',56527785,N'خ چمران 300متر داخل خيابان ',1,2,0,463)
Insert Into Building Values(N'رنجبر',55215799,N'جاده قديم قم بعداز سه راهي پالايشگاه خ شهرسنک خ 15 پلاک 18',1,1,0,341)
Insert Into Building Values(N'زرين بهار',33741400,N'ميدان شوش دولت اباد بلوار شهرزاد روبروي پمپ بنزين کيا ',1,2,0,182)
Insert Into Building Values( N'سپهر',56545712,N'شصت متري شورآباد خ ششم شمالي دست چپ درب سبز رنگ پلاک 6',1,2,0,475)
Insert Into Building Values( N'ستوده ',33862882,N'سه راه افسريه خ خاوران گردنه تنباکويي روبروي مصالح شهرداري ',1,1,0,694)
Insert Into Building Values( N'سلام ',55218900,N'خ شهيد رجايي خ شهرسنگ روبروي فرعي دوم ',1,2,0,643)
Insert Into Building Values( N'سهند',56540122,N'شصت متري شورآباد 30متري ششم جنوبي ',1,1,0,658)
Insert Into Building Values( N'سهيل ',33399392,N'خ فداييان اسلام بعداز کمربندي آزادگان پايين تر از پمپ بنزين داخل باربري دليجان اميد ',1,1,0,869)
Insert Into Building Values( N'سوگند',55062473,N'خ فداييان اسلام بعداز پل بعثت ايستگاه ميهن ',1,2,0,828)
Insert Into Building Values( N'صدرا',56530445,N'جاده واوان نرسيده به پل اتوبان قم دست چپ مجتمع آزادگان ',1,2,0,506)
Insert Into Building Values( N'طايران ',56540735,N'اول جاده قديم قم بعداز شورآباد مهدي آباد جنب بانک رفاه خ يکم شرقي  4راه چهارم ',1,1,0,598)
Insert Into Building Values( N'عالم شکن ',55188412,N'خ فداييان اسلام نرسيده به اتوبان آزادگان ايستگاه عوارضي کوچه مهرگان پلاک 18جديد',1,2,0,584)
Insert Into Building Values( N'عدل آرام ',55527517,N'خ رجايي بعداز 13آبان نرسيده به بيمارستان 7تير خ امامزاده ابوالحسن ',1,2,0,407)
Insert Into Building Values( N'عدل صالح ',33876495,N'جاده خاوران بعداز ميدان آقانور روبروي بازار مصالح ',1,2,0,298)
Insert Into Building Values( N'عدل عليزاده ',33408900,N'خ فداييان اسلام اول جاده ورامين سه راه تقي آباد ابتداي خيابان امين آباد خ عرب خواري پلاک 16',1,2,0,971)
Insert Into Building Values( N'عرب ',56546190,N'جاده قديم شورآباد خ شهيد مدني جنب 4راه 22بهمن پلاک 32',1,1,0,746)
Insert Into Building Values( N'عرفان ',55215323,N'جاده قديم قم مقابل اسياب قرمز انبار عرفان ',1,1,0,192)
Insert Into Building Values( N'عسگري ',33877222,N'سه راه افسريه اول خيابان مظاهر انبار چاي',1,2,0,221)
Insert Into Building Values( N'علي ',33753161,N'خيابان فداييان اسلام نرسيده به پل سيمان کوچه سرزعيم ',1,2,0,953)
Insert Into Building Values( N'فتح المبين 1',55202201,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي اول  ',1,1,0,880)
Insert Into Building Values( N'فتح المبين 2',55207191,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي  سوم  ',1,1,0,605)
Insert Into Building Values( N'فجر',55207000,N'جاده قديم قم شهر سنگ جنب شرکت سايپا پرس پلاک 40 ',1,1,0,344)
Insert Into Building Values( N'فرديس',33398897,N'ابتداي جاده قديم قم بعداز سه راهي بهشتي خ ايران ترانسفو فرعي سوم پلاک 22',1,2,0,772)
Insert Into Building Values( N'فرشاد',33765926,N'خ فداييان اسلام نرسيده به پل سيمان  خ شهيد غيبي پلاک 12',1,1,0,931)
Insert Into Building Values(N'قائم ',55188677,N'خيابان فداييان اسلام بلوار ابريشم خ ياس پلاک 13',1,2,0,330)
Insert Into Building Values(N'گودير',66807730,N'صفادشت شهرک صنعتي صفادشت خ ششم غربي بعداز ميدان تقاطع دوم ',1,1,0,805)
Insert Into Building Values(N'مجتبي',56541468,N'شصت متري شورآبادبعداز خيابان پنجم جنوبي دست راست پلاک 110',1,1,0,808)
Insert Into Building Values( N'محسن ',55004916,N'خيابان فداييان اسلام پشت پمپ بنزين زهره بند جنب باشگاه پورا پلاک 42',1,1,0,890)
Insert Into Building Values( N'محمد',33822260,N'سه راه افسريه اول خيابان مظاهر داخل انبار چاي',1,1,0,178)
Insert Into Building Values( N'مهديه ',33371618,N'اول دولت اباد بلوار قدس پلاک 226 ',1,2,0,340)
Insert Into Building Values(N'مهرفرهاد',33860715,N'گردنه تنباکويي بالاتر از انبار مصالح شهرداري ',1,2,0,307)
Insert Into Building Values(N'نقش جهان ',55202723,N'جاده قديم قم بعداز سه راه ترانسفو کوچه آسياب قرمز',1,2,0,793)
Insert Into Building Values(N'هجرت ',33867304,N'سه راه افسريه خ 20متري شرکت واحد  پلاک 4',1,1,0,332)





/*__________________________Adding by Stored Procedures_________________________________*/

exec Add_ItemType N'غلات'	
exec Add_ItemType N'ابزار'	
exec Add_ItemType N'مایعات'	

exec Add_Item N'گندم' ,1,10,1
exec Add_Item N'برنج' ,1,75,1
exec Add_Item N'ذرت' ,1,50,1
exec Add_Item N'جو' ,1,120,1
exec Add_Item N'آب' ,2,120,3 	

exec Add_Item N'آسیاب میکسر و بالابر',3,6,2
exec Add_Item N'انتقال دان',3,5,2
exec Add_Item N'اینلت',3,25,2
exec Add_Item N'آبخوری',3,5,2
exec Add_Item N'پد کولینگ',3,50,2
exec Add_Item N'تابلو برق',3,1,2
exec Add_Item N'جت هیتر',3,1,2
exec Add_Item N'دانخوری',3,1,2
exec Add_Item N'مه پاش',3,1,2
exec Add_Item N'هواکش',3,1,2
exec Add_Item N'هیتر کابینتی',3,1,2
exec Add_Item N'قفس',3,5,2 

 
exec Add_Unit N'کیلوگرم'	
exec Add_Unit N'لیتر'	
exec Add_Unit N'عدد'	

	 

exec Add_City N'آذربایجان شرقی' 
exec Add_City N'اصفهان'
exec Add_City N'البرز'
exec Add_City N'ایلام'
exec Add_City N'بوشهر'
exec Add_City N'تهران'
exec Add_City N'چهارمحال و بختیاری' 
exec Add_City N'خراسان جنوبی'
exec Add_City N'خراسان رضوی'
exec Add_City N'خراسان شمالی'
exec Add_City N'خوزستان'
exec Add_City N'زنجان'
exec Add_City N'سمنان'
exec Add_City N'سیستان و بلوچستان'
exec Add_City N'فارس'
exec Add_City N'قزوین'
exec Add_City N'قم'
exec Add_City N'کردستان'
exec Add_City N'کرمان'
exec Add_City N'کرمانشاه'
exec Add_City N'کهگیلویه و بویراحمد'
exec Add_City N'گلستان'
exec Add_City N'گیلان'
exec Add_City N'لرستان'
exec Add_City N'مازندران'
exec Add_City N'مرکزی'
exec Add_City N'هرمزگان'
exec Add_City N'همدان'
exec Add_City N'یزد'






exec Add_Building N'ابريشم',56541090,N'شور آباد   بين  خيابان  اول  و دوم',1,2,0,958
exec Add_Building N'آرمين ',56541090,N'جاده قديم قم بعد از شورآباد روبروي مهدي آباد خ يکم شرقي هفتمين چهارراه دست راست اخرين بنگاه ',1,1,0,316
exec Add_Building N'احمد کريمي',55300555,N'ضلع شمال شرقي ترمينال جنوب  بعداز مسجد اقدس اولين خ دست چپ-شهيد رسول عالي پلاک 56',1,2,0,413
exec Add_Building N'احمديه ',56545862,N'شصت متري شورآباد  سي متري سوم جنوبي ',1,1,0,491
exec Add_Building N'اطلس',55303628,N'روبه روي بهشت زهراء  خيابان رجايي  جنب مسجد مادر',1,1,0,914
exec Add_Building N'اعتماد',55228102,N'ابتداي جاده قديم قم  خ ترانسفور کوچه دوم پلاک 8  ',1,1,0,679
exec Add_Building N'افق شرق',33477256,N'سه راه افسريه شهرک مسعوديه  20متري شيرازي جنب بنگاه عقدايي پلاک 831',1,1,0,952
exec Add_Building N'خاوران/تقي پور',33450157,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد',1,2,0,294
exec Add_Building N'خاوران/ صالحي',33461102,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,927
exec Add_Building N'خاوران /عسگري',33879511,N'سه راه افسريه خ خاوران نرسيده به ميدان آقانور 20متري خ شرکت واحد ',1,2,0,675
exec Add_Building N'بيزن ',33749246,N'فداييان اسلام  پايين ترازپل سيمان  خ ابن بابويه پهارراه پشمه علي  بعداز خ ابوذر جنب پمپ گاز پلاک8',1,2,0,931
exec Add_Building N'پارس',55060644,N'بعداز پل بعثت خ شهرزاد 20متري وفا پلاک 515',1,1,0,862
exec Add_Building N'تعاون ',55228025,N'خيابان ترانسفوت کوچه 4  پلاک 10',1,2,0,635
exec Add_Building N'تعاوني ',55228025,N'خيابان ترانسفورت  کوچه3 پلاک 14',1,1,0,887
exec Add_Building N'تهران دز',33742085,N'خ فداييان اسلام جنوبي جنب چيت ممتاز کوچه مختاري ',1,1,0,153
exec Add_Building N'جاويد',55228105,N'جاده قديم قم  خيابان ترانسفو گوچه دوم',1,1,0,860
exec Add_Building N'خالقي ',33747322,N'خ سوم دولت اباد-بالاتراز ميدان دولت اباد-دست راست خ قدس  روبروي مسجد سيدالشهداء پلاک 3',1,2,0,601
exec Add_Building N'داوري ',55009092,N'اول اتوبان بهشت زهراء بعداز پل صنيع خاني صالح آباد غربي خ کلهر پ 68',1,1,0,207
exec Add_Building N'رضايي و شرکاء',56527785,N'خ چمران 300متر داخل خيابان ',1,2,0,463
exec Add_Building N'رنجبر',55215799,N'جاده قديم قم بعداز سه راهي پالايشگاه خ شهرسنک خ 15 پلاک 18',1,1,0,341
exec Add_Building N'زرين بهار',33741400,N'ميدان شوش دولت اباد بلوار شهرزاد روبروي پمپ بنزين کيا ',1,2,0,182
exec Add_Building N'سپهر',56545712,N'شصت متري شورآباد خ ششم شمالي دست چپ درب سبز رنگ پلاک 6',1,2,0,475
exec Add_Building N'ستوده ',33862882,N'سه راه افسريه خ خاوران گردنه تنباکويي روبروي مصالح شهرداري ',1,1,0,694
exec Add_Building N'سلام ',55218900,N'خ شهيد رجايي خ شهرسنگ روبروي فرعي دوم ',1,2,0,643
exec Add_Building N'سهند',56540122,N'شصت متري شورآباد 30متري ششم جنوبي ',1,1,0,658
exec Add_Building N'سهيل ',33399392,N'خ فداييان اسلام بعداز کمربندي آزادگان پايين تر از پمپ بنزين داخل باربري دليجان اميد ',1,1,0,869
exec Add_Building N'سوگند',55062473,N'خ فداييان اسلام بعداز پل بعثت ايستگاه ميهن ',1,2,0,828
exec Add_Building N'صدرا',56530445,N'جاده واوان نرسيده به پل اتوبان قم دست چپ مجتمع آزادگان ',1,2,0,506
exec Add_Building N'طايران ',56540735,N'اول جاده قديم قم بعداز شورآباد مهدي آباد جنب بانک رفاه خ يکم شرقي  4راه چهارم ',1,1,0,598
exec Add_Building N'عالم شکن ',55188412,N'خ فداييان اسلام نرسيده به اتوبان آزادگان ايستگاه عوارضي کوچه مهرگان پلاک 18جديد',1,2,0,584
exec Add_Building N'عدل آرام ',55527517,N'خ رجايي بعداز 13آبان نرسيده به بيمارستان 7تير خ امامزاده ابوالحسن ',1,2,0,407
exec Add_Building N'عدل صالح ',33876495,N'جاده خاوران بعداز ميدان آقانور روبروي بازار مصالح ',1,2,0,298
exec Add_Building N'عدل عليزاده ',33408900,N'خ فداييان اسلام اول جاده ورامين سه راه تقي آباد ابتداي خيابان امين آباد خ عرب خواري پلاک 16',1,2,0,971
exec Add_Building N'عرب ',56546190,N'جاده قديم شورآباد خ شهيد مدني جنب 4راه 22بهمن پلاک 32',1,1,0,746
exec Add_Building N'عرفان ',55215323,N'جاده قديم قم مقابل اسياب قرمز انبار عرفان ',1,1,0,192
exec Add_Building N'عسگري ',33877222,N'سه راه افسريه اول خيابان مظاهر انبار چاي',1,2,0,221
exec Add_Building N'علي ',33753161,N'خيابان فداييان اسلام نرسيده به پل سيمان کوچه سرزعيم ',1,2,0,953
exec Add_Building N'فتح المبين 1',55202201,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي اول  ',1,1,0,880
exec Add_Building N'فتح المبين 2',55207191,N'ابتداي جاده قديم قم بعدار سه راه بهشتي خ ايران ترنسفو فرعي  سوم  ',1,1,0,605
exec Add_Building N'فجر',55207000,N'جاده قديم قم شهر سنگ جنب شرکت سايپا پرس پلاک 40 ',1,1,0,344
exec Add_Building N'فرديس',33398897,N'ابتداي جاده قديم قم بعداز سه راهي بهشتي خ ايران ترانسفو فرعي سوم پلاک 22',1,2,0,772
exec Add_Building N'فرشاد',33765926,N'خ فداييان اسلام نرسيده به پل سيمان  خ شهيد غيبي پلاک 12',1,1,0,931
exec Add_Building N'قائم ',55188677,N'خيابان فداييان اسلام بلوار ابريشم خ ياس پلاک 13',1,2,0,330
exec Add_Building N'گودير',66807730,N'صفادشت شهرک صنعتي صفادشت خ ششم غربي بعداز ميدان تقاطع دوم ',1,1,0,805
exec Add_Building N'مجتبي',56541468,N'شصت متري شورآبادبعداز خيابان پنجم جنوبي دست راست پلاک 110',1,1,0,808
exec Add_Building N'محسن ',55004916,N'خيابان فداييان اسلام پشت پمپ بنزين زهره بند جنب باشگاه پورا پلاک 42',1,1,0,890
exec Add_Building N'محمد',33822260,N'سه راه افسريه اول خيابان مظاهر داخل انبار چاي',1,1,0,178
exec Add_Building N'مهديه ',33371618,N'اول دولت اباد بلوار قدس پلاک 226 ',1,2,0,340
exec Add_Building N'مهرفرهاد',33860715,N'گردنه تنباکويي بالاتر از انبار مصالح شهرداري ',1,2,0,307
exec Add_Building N'نقش جهان ',55202723,N'جاده قديم قم بعداز سه راه ترانسفو کوچه آسياب قرمز',1,2,0,793
exec Add_Building N'هجرت ',33867304,N'سه راه افسريه خ 20متري شرکت واحد  پلاک 4',1,1,0,332



exec Add_Employer N'ali',N'محمدی','001',24,N'مرد',021580184,N'بلوار کشاورز، روبه‌روی وزارت کشاورزی، شماره 178',552280435,6
exec Add_Employer N'سمانه',N'دوستی','4324696',24,N'زن',021530174,N'خیابان زعفرانیه، بلوار بهزادی، نبش خیابان ماکویی‌پور',552280435,6
exec Add_Employer N'علی اصغر',N'آمینون','732193',24,N'مرد',021651260,N'بزرگراه آفریقا، نرسیده به چهارراه جهان کودک، پلاک 31',53921768,6
exec Add_Employer N'سید محمد',N'ابراهیمی','9464822',21,N'مرد',021582353,N'تهران، خیابان نلسون ماندلا (جردن)، بالاتر از خیابان اسفندیار، نبش شمالی خیابان سعیدی، پلاک 158',836175230,6
exec Add_Employer N'سیده نیره',N'ابطحی نصیری','2144802',29,N'زن',021350373,N'تهران، خیابان الهیه، خیابان شهید آقابزرگی، نبش خیابان استانبول، پلاک 37',156644152,6
exec Add_Employer N'مهدی',N'ابوالقاسمی','3779502',30,N'مرد',021761337,N'خیابان شهید کلاهدوز (دولت)، خیابان اختیاریه جنوبی، نبش کوچه خداجو، پلاک 26',755925118,6
exec Add_Employer N'رقیه',N'احدی','6909861',22,N'زن',021664348,N'بلوار فرحزادی، نبش ارغوان غربی، مجتمع تجاری اریکه ایرانیان، پلاک 1',596028006,6
exec Add_Employer N'حسین',N'احدی','6135209',18,N'مرد',021770506,N'خیابان اقدسیه، نبش کوچه نسیم، پلاک 63',441167701,6
exec Add_Employer N'سارا',N'احمد نژاد','55263',24,N'زن',021260600,N'الهیه، خیابان شهید فیاضی (فرشته)، کوچه امین، پلاک 5',659384494,6
exec Add_Employer N'محمد صادق',N'اسحاقی','8592776',31,N'مرد',021855345,N'میدان بهارستان، خیابان مصطفی خمینی، خیابان امیرکبیر شرقی (امین حضور)، نبش کوچه علیرضا جاویدی، پلاک 120',749668416,6
exec Add_Employer N'لیلی',N'اسحقی','3870392',19,N'زن',021866776,N'شهرک غرب، خیابان ايران زمين، مجتمع تجاری ايران زمين، پلاک 13',58291181,6
exec Add_Employer N'اعظم',N'اسدی نوری','3294554',22,N'زن',021268026,N'ابتدای اتوبان کرج، خیابان آزادگان، برج هواپيمايی ماهان',458671022,6
exec Add_Employer N'عفت',N'اسفندیاری','2294595',27,N'زن',021226677,N'بازار، خیابان 15 خرداد غربی، بین چهارراه گلوبندک و ابوسعید، پلاک 681',138739726,6
exec Add_Employer N'رضا',N'اسمعیل محمدی','7709977',29,N'مرد',021890342,N'بازار بزرگ، سبزه میدان، بازار کفاش‌ها، نبش بازار خیاط‌ها، پلاک 64',132061846,6
exec Add_Employer N'پروانه',N'اعزاز','9039510',32,N'زن',021140674,N'خیابان وليعصر، روبروی باغ‌فردوس، بالاتر از سه‌راه زعفرانیه',642393574,6
exec Add_Employer N'مهدی',N'اله وردیلی','1774924',28,N'مرد',021785970,N'بزرگراه فتح، بعد از شير پاستوريزه، مجتمع تجاری تهران، پلاک 238',136657364,6
exec Add_Employer N'علی',N'الیاسی','7421977',21,N'مرد',021414219,N'سعادت‌آباد، ميدان فرهنگ، بلوار 24 متری ، نبش 4 غربی، پلاک18',146071110,6
exec Add_Employer N'حمید رضا',N'امجدی سنگری','6687860',24,N'مرد',021638811,N'سعادت‌آباد، بلوار دريا، نبش خیابان رامشه، شماره 50',125297579,6
exec Add_Employer N'زهره',N'امینی فرد','381278',22,N'زن',021809823,N'بلوار فردوس، بزرگراه شهید ستاری، ابتدای بلوار فردوس شرقی، پلاک 434',772504044,6
exec Add_Employer N'ریحانه',N'بابایی','2103718',20,N'زن',021335707,N'شهرک ژاندارمری، بلوار مرزداران، بین ایثار و دانش، شماره 136',774815876,6
exec Add_Employer N'احمد',N'باغکی','6937910',32,N'مرد',021570824,N'بلوار کشاورز، روبه‌روی وزارت کشاورزی، شماره 178',377149372,6
exec Add_Employer N'نسرین',N'باغکی','788340',22,N'زن',021973373,N'تهرانسر، بلوار اصلی، نبش خیابان 14، شماره 64',377305060,6
exec Add_Employer N'مهدی',N'برهمند','4173311',28,N'مرد',021828723,N'خیابان ولیعصر، نرسیده به چهارراه پارک‌وی، نبش کوچه ترکش‌دوز، شماره 2',576735310,6
exec Add_Employer N'الهه',N'پرستار','3636745',22,N'زن',021144257,N'خيابان جنت‌آباد جنوبی، میدان چهارباغ، خیابان لاله غربی، مجتمع سمرقند، شماره 47',91532525,6
exec Add_Employer N'محمد',N'پسندیده','7403921',21,N'مرد',021114746,N'خیابان آزادی، نبش خیابان آذربایجان، پلاک 1046',787070005,6
exec Add_Employer N'عباس',N'پناهی','2290497',28,N'مرد',021447240,N'خیابان جمهوری، بین خیابان ولیعصر و خیابان شیخ هادی، شماره 852',862219260,6
exec Add_Employer N'هادی',N'پویاوند','3035666',23,N'مرد',021183205,N'میدان تجریش، انتهای خیابان دزاشیب، سه‌راه عمار، شماره 158',319634387,6
exec Add_Employer N'فرج اله',N'تقوی','8985396',18,N'مرد',021242273,N'خیابان کامرانیه، خیابان شهید لواسانی غربی، دوراهی آریا، شماره 5',315412772,6
exec Add_Employer N'شعبانعلی',N'تلیمی','4417599',24,N'مرد',021705140,N'خيابان دولت، نرسيده به چهارراه پاسداران، شماره 18',869558248,6
exec Add_Employer N'محمد',N'تمیم','7598350',25,N'مرد',021104694,N'خیابان سعدی جنوبی، خیابان اکباتان، شماره 93',378264264,6
exec Add_Employer N'فاطمه',N'تنها','4548486',27,N'زن',021784028,N'خیابان ولیعصر، بالاتر از خیابان دکتر بهشتی، نبش کوچه کوزه‌گر، شماره 2133',652857035,6
exec Add_Employer N'زینب',N'توسلی','5644724',23,N'زن',021915702,N'خیابان ولیعصر، بالاتر از میدان ولیعصر، نرسیده به کوچه ناصر، پلاک 1777',831469801,6
exec Add_Employer N'لیلا',N'جعفری نژاد','8838164',20,N'زن',021726515,N'خیابان شریعتی، دروس، بلوار شهرزاد، خیابان شیدایی، کوچه اسپند، شماره 2',807367374,6
exec Add_Employer N'منصور',N'جوادی زاده','9028791',30,N'مرد',021637847,N'تهران، میدان رسالت، خیابان هنگام، بلوار دلاوران، بین چهارراه آزادگان و تکاوران، پلاک 375',587847426,6
exec Add_Employer N'محمد باقر',N'جوزقی','5374143',31,N'مرد',021846603,N'میدان المپیک، بلوار دهکده المپیک، نبش خیابان شهید یعقوبی (خیابان15)، شماره 2',737421952,6
exec Add_Employer N'مهدی',N'جوکار','425117',31,N'مرد',021150387,N'تهران، خیابان شهید دکتر بهشتی، بعد از چهارراه سهروردی، پلاک 138',358625428,6
exec Add_Employer N'فاطمه',N'جهانشاهی','4969485',30,N'زن',021467381,N'خیابان دکتر فاطمی، روبه‌روی خیابان کاخ، نبش کوچه ششم (شیخلر)، پلاک 140',233225628,6
exec Add_Employer N'مجید',N'حاجتی','8109785',18,N'مرد',021278108,N'خیابان زعفرانیه، سه‌راه آصف، ابتدای خیابان طاهری، شماره 3 و 5',46536968,6
exec Add_Employer N'محمد رضا',N'حبیبی','2188733',23,N'مرد',021488533,N'میدان توحید، خیابان ستارخان، روبه‌روی باقرخان، نبش کوچه ستایش، شماره 2',234821270,6
exec Add_Employer N'مژگان',N'حجه الاسلامی','8779749',23,N'زن',021892365,N'خیابان سعادت‌آباد، بلوار سرو غربی، نبش شمال شرقی میدان سرو، شماره 77',232447653,6
exec Add_Employer N'محمدرضا',N'حسنی','7287878',30,N'مرد',021287860,N'خیابان سعادت‌آباد، میدان کاج، شماره 13',768738860,6
exec Add_Employer N'زهره',N'حسنی','9193344',19,N'زن',021736265,N'خيابان سيد جمال‌الدين اسدآبادی، نبش شمالی خیابان 49، شماره 433',262225214,6
exec Add_Employer N'علی',N'حسنی زاده','8716389',28,N'مرد',021298699,N'خیابان جمهوری، خیابان سی‌تیر، نبش کوچه بهزاد، شماره 65',791041386,6
exec Add_Employer N'ابراهیم',N'حسینی','9551394',33,N'مرد',021984950,N'تهران، شمس‌آباد، خیابان استاد حسن بنا، بالاتر از میدان ملت، نبش خیابان شهید شاهرخ عبدی، پلاک 771',545529122,6
exec Add_Employer N'لیلا',N'خادم زاده','8432249',19,N'زن',021134558,N'شهر قدس (قلعه حسن‌خان)، بلوار 45متری انقلاب، روبه‌روی پارک آزادگان، پلاک 368',613876194,6
exec Add_Employer N'عباس',N'خان محمدیان','1149104',26,N'مرد',021193251,N'شهران، فلکه دوم شهران، ابتدای خیابان یکم، پلاک 4',150793372,6
exec Add_Employer N'مهدی',N'خان محمدیان','8690822',23,N'مرد',021576239,N'شهر ری، خيابان 24 متری (زکریای رازی)، شماره 257',41739422,6
exec Add_Employer N'علیرضا',N'خبیری','2574147',34,N'مرد',021480839,N'شهريار، خیابان وليعصر،ضلع شرقی میدان امام خمینی، پلاک 130',589638128,6
exec Add_Employer N'اسماعیل',N'خدایاری','9764999',32,N'مرد',021425574,N'تهران، شهرک اکباتان، فاز 2، بلوار گل‌ها، پلاک 1',614510022,6
exec Add_Employer N'علیرضا',N'خلج','7677487',22,N'مرد',021655786,N'شهرک راه‌آهن (گلستان)، بلوار امیرکبیر، نبش چهارراه گلها، پلاک53',437827548,6
exec Add_Employer N'علیرضا',N'درستکار','5660948',19,N'مرد',021229715,N'ضلع جنوب‌شرقی فلکه اول صادقیه، پلاک918',620370169,6
exec Add_Employer N'اسمعیل',N'دشتی','6408703',24,N'مرد',021430822,N'کیلومتر 30 اتوبان تهران - قم، فرودگاه بين‌المللی امام خمينی، سالن ورودی، طبقه همکف',794686488,6
exec Add_Employer N'محمود',N'دلگشا','559614',27,N'مرد',021808205,N'ابتدای جاده مخصوص کرج، ترمينال شماره 2 فرودگاه مهرآباد، پایین پارکینگ طبقاتی',738340002,6
exec Add_Employer N'علی',N'دهقانپور','7570711',34,N'مرد',021684997,N'فلکه اول تهرانپارس، ابتدای خیابان حجر بن عدی، نبش خیابان 148 غربی، پلاک 32',190437748,6
exec Add_Employer N'مهدی',N'رایگان','7886947',20,N'مرد',021774364,N'خیابان تهرانپارس، بالاتر از فلکه سوم، نبش خیابان 214 شرقی، پلاک 130',366397358,6
exec Add_Employer N'بهروز',N'رحمتی','3092958',30,N'مرد',021375451,N'خیابان شریعتی، بالاتر از دوراهی قلهک، نبش کوچه خلیل‌پور، پلاک 1498',336102801,6
exec Add_Employer N'رسول',N'رحمتی','2388325',31,N'مرد',021705793,N'تهران، بلوار 35متری قیطریه، روبروی پارک قیطریه، پلاک 85',59639560,6
exec Add_Employer N'محمد علی',N'رحیمی','6708140',26,N'مرد',021669677,N'خیابان انقلاب، بین چهارراه کالج و ولیعصر، پلاک 803',105239448,6
exec Add_Employer N'محمود',N'رستمی','9999988',30,N'مرد',021836555,N'خیابان زعفرانیه،خیابان مقدس اردبیلی، نبش شرقی خیابان فرخ، پلاک1',520387226,6
exec Add_Employer N'رسول',N'رستمیان','8425722',19,N'مرد',021523661,N'خيابان ملاصدرا، بعد از خیابان شیراز، پلاک 132',940372733,6
exec Add_Employer N'محسن',N'رضایی','5554256',22,N'مرد',021823058,N'تهران، خیابان ولیعصر، میدان منیریه، خیابان معیری، نبش بن بست ناظمی، پلاک 53',111767852,6
exec Add_Employer N'عباس',N'رضائی','2894730',31,N'مرد',021221945,N'خیابان مولوی شرقی، ایستگاه سعادت، نبش کوچه شهید علی‌اکبر قاسمی، پلاک 518',265599263,6
exec Add_Employer N'بهروز',N'رضائی','918228',32,N'مرد',021582509,N'تهران، میدان آرژانتین، اول خیابان بیهقی، پلاک 21',863965627,6
exec Add_Employer N'رضا',N'رفعت','9119505',34,N'مرد',021918139,N'میدان تجریش، خیابان شهرداری، پلاک 81',343107104,6
exec Add_Employer N'سلیمان',N'رهنما','5525963',21,N'مرد',021772687,N'چهارراه پاسداران، میدان حسین‌آباد، ساختمان مهدی، پلاک 120',735093034,6
exec Add_Employer N'مهدی',N'ساوه ای','6237239',23,N'مرد',021643245,N'خيابان کارگرجنوبی، ضلع شمال شرقی ميدان قزوين، پلاک18',254324900,6
exec Add_Employer N'زهرا',N'ساوهء','3072702',27,N'زن',021846019,N'بزرگراه رسالت، خیابان آیت، ضلع جنوب‌غربی میدان نبوت، پلاک 560',229847035,6
exec Add_Employer N'علیرضا',N'سبزیکار','953981',28,N'مرد',021330116,N'تهران، خیابان ولیعصر، بالاتر از میدان ونک، نبش خیابان برادران شریفی، پلاک 2477',570877277,6
exec Add_Employer N'سید احمد',N'سبط احمدی','5940317',31,N'مرد',021266467,N'نیاوران، انتهای خیابان مقدسی، ابتدای خیابان میری، پلاک 4',314175520,6
exec Add_Employer N'سیده رضوان',N'سجادی','562160',31,N'زن',021875428,N'خیابان میرداماد، نرسیده به میدان مادر، پلاک 148',346921422,6
exec Add_Employer N'علی اصغر',N'سعادتپور','6064896',34,N'مرد',021401364,N'تهران، نازی‌آباد، خیابان مدائن، پلاک 116 و 118',221290862,6
exec Add_Employer N'زهره',N'سعادتمندی','8106925',28,N'زن',021348070,N'تهران، نیاوران، خیابان شهید باهنر، روبروی پارک باهنر، پلاک 148',631950061,6
exec Add_Employer N'فاطمه',N'سعیدی','7857649',20,N'زن',021419386,N'تهران، بزرگراه شهید باکری جنوب، مرکز خرید هایپر استار',909257548,6
exec Add_Employer N'زهره',N'سعیدی','3256712',26,N'زن',021177445,N'تهران، خیابان ولنجک، خیابان چهاردهم، پلاک 7',727778423,6
exec Add_Employer N'اکبر',N'سلامت','3144461',23,N'مرد',021751784,N'خیابان پاسداران، روبه‌روی بوستان ششم، شماره 238',723398145,6
exec Add_Employer N'مهدی',N'سلیمی','2852157',26,N'مرد',021358377,N'خيابان شريعتی، بالاتر از پل رومی، نبش کوچه سلمان، پلاک 1769',813704890,6
exec Add_Employer N'تقی',N'سلیمی هیزجی','9372422',32,N'مرد',021857453,N'خیابان اشرفی اصفهانی، بالاتر از ميدان پونک، نبش خیابان 19، شماره 1',548640004,6
exec Add_Employer N'مهدیه',N'سنماری','128930',25,N'زن',021941596,N'خیابان پیروزی، خیابان صد دستگاه، نبش خیابان عادلی، شماره 519',982883400,6
exec Add_Employer N'علیرضا',N'شاهمردانی','9476932',32,N'مرد',021318321,N'خیابان کارگر شمالی، بالاتر از چهارراه دکتر فاطمی، شماره 1615',843468676,6
exec Add_Employer N'علی',N'شعبانی','147069',25,N'مرد',021474943,N'تهران، خیابان کریم‌خان زند، نرسیده به میدان هفت تیر، پلاک 42',756938271,6
exec Add_Employer N'پروین',N'صادقی','9160068',18,N'مرد',021478270,N'کوی نصر (گیشا) ، نبش خيابان نوزدهم، پلاک 262',998839841,6
exec Add_Employer N'زهره',N'صادقی فرد','5318701',32,N'زن',021804087,N'تهران، بزرگراه آیت اله سعیدی، یافت‌آباد شرقی، بازار مبل ایران، پلاک 202 و 205',157247938,6
exec Add_Employer N'راضیه',N'صادقیان','6388491',26,N'زن',021689619,N'ابتدای جاده مخصوص کرج، ترمينال شماره 2 فرودگاه مهرآباد، پایین پارکینگ طبقاتی',532393757,6
exec Add_Employer N'غلامرضا',N'صبوحی','3880135',21,N'مرد',021717972,N'خیابان کارگر شمالی، بالاتر از چهارراه دکتر فاطمی، شماره 1615',30679501,6
exec Add_Employer N'الهه',N'صداقت','3231594',27,N'زن',021969683,N'تهران، خیابان کریم‌خان زند، نرسیده به میدان هفت تیر، پلاک 42',72138547,6
exec Add_Employer N'جعفر',N'صدری','7326878',23,N'مرد',021177194,N'کوی نصر (گیشا) ، نبش خيابان نوزدهم، پلاک 262',967236949,6
exec Add_Employer N'مجتبی',N'صدیق','5957911',30,N'مرد',021419310,N'تهران، بلوار 35متری قیطریه، روبروی پارک قیطریه، پلاک 85',647092992,6
exec Add_Employer N'مصطفی',N'صفرخانی','848630',20,N'مرد',021110345,N'خیابان انقلاب، بین چهارراه کالج و ولیعصر، پلاک 803',980199562,6
exec Add_Employer N'بهزاد',N'صناعی','565313',26,N'مرد',021727038,N'خیابان زعفرانیه،خیابان مقدس اردبیلی، نبش شرقی خیابان فرخ، پلاک1',815168546,6
exec Add_Employer N'زهرا',N'طالب حقیقی','8145223',28,N'زن',021389951,N'خيابان ملاصدرا، بعد از خیابان شیراز، پلاک 132',623772207,6
exec Add_Employer N'محمد رضا',N'طاووسی','5022298',19,N'مرد',021503747,N'تهران، خیابان ولیعصر، میدان منیریه، خیابان معیری، نبش بن بست ناظمی، پلاک 53',456127196,6
exec Add_Employer N'محمد',N'عرفانی نسب','5813273',21,N'مرد',021598362,N'تهران، بزرگراه آیت اله سعیدی، یافت‌آباد شرقی، بازار مبل ایران، پلاک 202 و 205',857916844,6
exec Add_Employer N'محمد رضا',N'عشرتی','6181703',34,N'مرد',021760791,N'خیابان تهرانپارس، بالاتر از فلکه سوم، نبش خیابان 214 شرقی، پلاک 130',35264513,6
exec Add_Employer N'نجمه',N'عطارد','6074801',33,N'زن',021808301,N'فلکه اول تهرانپارس، ابتدای خیابان حجر بن عدی، نبش خیابان 148 غربی، پلاک 32',670951177,6
exec Add_Employer N'طاهره',N'عطائیان','9288060',30,N'زن',021153109,N'خیابان شریعتی، بالاتر از دوراهی قلهک، نبش کوچه خلیل‌پور، پلاک 1498',19379930,6
exec Add_Employer N'مجید',N'علیجانی','3087751',29,N'مرد',021513546,N'شهرک راه‌آهن (گلستان)، بلوار امیرکبیر، نبش چهارراه گلها، پلاک53',64875257,6
exec Add_Employer N'سعید',N'علیزادگان','2523463',19,N'مرد',021153401,N'ضلع جنوب‌شرقی فلکه اول صادقیه، پلاک918',382270664,6
exec Add_Employer N'علیرضا',N'عمان','1719657',32,N'مرد',021128433,N'کیلومتر 30 اتوبان تهران - قم، فرودگاه بين‌المللی امام خمينی، سالن ورودی، طبقه همکف',322902009,6
exec Add_Employer N'مرتضی',N'عموزاده','8150600',20,N'مرد',021599570,N'تهران، نازی‌آباد، خیابان مدائن، پلاک 116 و 118',240043651,6
exec Add_Employer N'معصومه',N'عیوضی','6480199',32,N'زن',021452497,N'تهران، نیاوران، خیابان شهید باهنر، روبروی پارک باهنر، پلاک 148',527598740,6
exec Add_Employer N'سید جلال',N'غائب','3879737',29,N'مرد',021400460,N'تهران، نیاوران، خیابان شهید باهنر، روبروی پارک باهنر، پلاک 148',580701337,6


/*_______________________City Stored Procedures___________________________*/
Create Procedure Add_City
@CityName nvarchar(50)
as
begin
Insert Into City Values(@CityName)
end


/*_______________________Hen Stored Procedures___________________________*/

Create Procedure Add_HenType
@name nvarchar(50)
as
begin
Insert Into HenType Values(@name) 
end

Create Procedure Update_HenType
@name nvarchar(50),
@Id int
as
begin
Update HenType Set name = @name where Id = @Id
end

Create Procedure Delete_HenType
@HenTypeId int
as
begin
Delete From HenType where Id = @HenTypeId
Delete From Hen where HenTypeId = @HenTypeId
end




/*___________________HenStatus Stored Procedures__________________________*/


Create Procedure Add_HenStatus
@name nvarchar(50)
as
begin
Insert Into HenStatus Values(@name) 
end

Create Procedure Update_HenStatus
@name nvarchar(50),
@Id int
as
begin
Update HenStatus Set name = @name where Id = @Id
end

Create Procedure Delete_HenStatus
@HenStatusId int
as
begin
Delete From HenStatus where Id = @HenStatusId
Delete From Hen where HenStatusId = @HenStatusId
end


/*_________________HenUsageType Stored Procedures__________________________*/


Create Procedure Add_HenUsageType
@name nvarchar(50)
as
begin
Insert Into HenUsageType Values(@name) 
end

Create Procedure Update_HenUsageType
@name nvarchar(50),
@Id int
as
begin
Update HenUsageType Set name = @name where Id = @Id
end

Create Procedure Delete_HenUsageType
@UsageTypeId int
as
begin
Delete From HenUsageType where Id = @UsageTypeId
Delete From Hen where UsageTypeId = @UsageTypeId
end



/*____________Operations Stored Procedures___________*/

Create Procedure Add_Operation
@name nvarchar(50)
as
begin
Insert Into Operation Values(@name) 
end

Create Procedure Update_Operation
@name nvarchar(50),
@Id int
as
begin
Update Operation Set name = @name where Id = @Id
end

Create Procedure Delete_Operation
@OperationId int
as
begin
Delete From Operation where Id = @OperationId
Delete From Cart where OperationId = @OperationId
end


/*____________Units Stored Procedures___________*/

Create Procedure Add_Unit
@name nvarchar(50)
as
begin
Insert Into Unit Values(@name) 
end

Create Procedure Update_Unit
@name nvarchar(50),
@Id int
as
begin
Update Unit Set name = @name where Id = @Id
end

Create Procedure Delete_Unit
@UnitId int
as
begin
Delete From Unit where Id = @UnitId
Delete From Item  where UnitId = @UnitId
end

/*_______________ItemType Stored Procedures___________________*/


Create Procedure Add_ItemType
@name nvarchar(50)
as
begin
Insert Into ItemType Values(@name) 
end



Create Procedure Update_ItemType
@name nvarchar(50),
@Id int
as
begin
Update ItemType Set name = @name where Id = @Id 
end

Create Procedure Delete_ItemType
@ItemType int
as
begin
Delete From ItemType where Id = @ItemType
Delete From Item  where ItemType = @ItemType
end

/*____________Item Stored Procedures_____________*/

Create Procedure Add_Item
@name nvarchar(50),
@UnitId int,
@CapacityUsage int,
@Itemtype int
as
begin
Insert Into Item Values(@name,@UnitId,@CapacityUsage,@Itemtype) 
end


Create Procedure Update_Item
@name nvarchar(50),
@UnitId int,
@CapacityUsage int,
@Itemtype int,
@ItemId int
as
begin
Update Item Set name = @name,UnitId = @UnitId,CapacityUsage = @CapacityUsage,Itemtype = @Itemtype where Id = @ItemId
end

Create Procedure Delete_Item
@ItemId int
as
begin
Delete From Item where Id = @ItemId
end


/*___________Cart Stored Procedures________________*/


Create Procedure Add_Cart
@ItemTypeId int,
@Number float,
@OperationId int,
@DoneHistory nvarchar(50),
@BarnId int
as
begin
Insert Into Cart Values(@ItemTypeId,@Number,@OperationId,@DoneHistory,@BarnId) 
end



Create Procedure Update_Cart
@ItemTypeId int,
@Number float,
@OperationId int,
@DoneHistory nvarchar(50),
@BarnId int
as
begin
Update Cart Set ItemTypeId = @ItemTypeId,Number = @Number,OperationId = @OperationId,DoneHistory = @DoneHistory,BarnId = @BarnId where BarnId = @BarnId
end

Create Procedure Delete_Cart
@ItemTypeId int,
@Number float,
@OperationId int,
@DoneHistory nvarchar(50),
@BarnId int
as
begin
Delete From Cart where ItemTypeId = @ItemTypeId and Number = @Number and OperationId = @OperationId and DoneHistory = @DoneHistory and BarnId = @BarnId 
end


/*___________Hen Stored Procedures_______________*/


Create Procedure Add_Hen
@BirthHistory nvarchar(50),
@HenTypeId int,
@HouseId int,
@UsageTypeId int,
@HenWeight float,
@HenStatusId int
as
begin
Insert Into Hen Values(@BirthHistory,@HenTypeId,@HouseId,@UsageTypeId,@HenWeight,@HenStatusId)
end

Create Procedure Update_Hen
@BirthHistory nvarchar(50),
@HenTypeId int,
@HouseId int,
@UsageTypeId int,
@HenWeight float,
@HenStatusId int,
@Id int
as
begin
Update Hen Set BirthHistory = @BirthHistory , HenTypeId = @HenTypeId , HouseId = @HouseId , UsageTypeId = @UsageTypeId , henWeight = @HenWeight , HenStatusId = @HenStatusId where HenId = @Id
end


Create Procedure Delete_Hen
@Id int
as
begin
Delete From Hen where HenId = @Id
end


/*____________Building Stored Procedures_______________*/


Create Procedure Add_Building
@name nvarchar(50),
@telephone nvarchar(50),
@address nvarchar(50),
@city int,
@buildingtype int,
@CurrentCapacity int,
@MaxCapacity int
as
begin
Insert Into Building Values(@name,@telephone,@address,@city,@buildingtype,@CurrentCapacity,@MaxCapacity)
end

Create Procedure Update_Building
@name nvarchar(50),
@telephone nvarchar(50),
@address nvarchar(50),
@city int,
@buildingtypeId int,
@CurrentCapacity int,
@MaxCapacity int,
@BuildingId int
as
begin
Update Building Set name = @name,@telephone = telephone,PlaceAddress = @address,cityId = @city,BuildingtypeId = @buildingtypeId,CurrentCapacity = @CurrentCapacity,MaxCapacity = @MaxCapacity  where @BuildingId = BuildingId
end


Create Procedure Delete_Building
@BuildingId int
as
begin
Delete From Building where @BuildingId = BuildingId
end


/*___________________Employer Stored Procedures____________________*/

Create Procedure Add_Employer
@name nvarchar(50),
@lastname nvarchar(50),
@pass nvarchar(50),
@age int,
@gender nvarchar(50),
@telephone nvarchar(50),
@homeAddress nvarchar(50),
@EmployerId nvarchar(50),
@CityId int
as
begin
Insert Into Employer Values(@name,@lastname,@pass,@age,@gender,@telephone,@homeAddress,@EmployerId,@CityId)
end

Create Procedure Delete_Employer
@Id nvarchar(50)
as
begin
Delete From Employer where EmployerId = @Id
end


Create Procedure Update_Employer
@name nvarchar(50),
@lastname nvarchar(50),
@pass nvarchar(50),
@age int,
@gender nvarchar(50),
@telephone nvarchar(50),
@homeAddress nvarchar(50),
@EmployerId nvarchar(50),
@CityId int
as
begin
Update Employer Set name = @name,lastname = @lastname,pass = @pass,age = @age,gender = @gender,telephone = @telephone,homeAddress = @homeAddress,cityid = @CityId where EmployerId = @EmployerId
end






/*************************************
**************************************/



/*____________CartInfo_____________*/


Create View CartInfo
as
Select 
Item.name as ItemName,
ItemType.name as ItemTypeName,
Cart.Number,
Unit.name as UnitName,
Item.CapacityUsage,
Operation.name as OperationName,
Cart.DoneHistory,
Building.name
from Cart,Operation,Unit,Item,Building,ItemType
where Cart.OperationId = Operation.Id and Item.ItemTypeId = Item.Id and Unit.Id= Item.UnitId and Cart.BarnId = Building.BuildingId



/*____________HenInfo_____________*/

Create View HenInfo
as 
Select
Hen.BirthHistory,
HenType.name as HenTypeName,
Building.name as HouseName,
HenUsageType.name as HenUsageTypeName,
Hen.HenWeight,
HenStatus.name as HenStatusName,
Hen.HenId as HenID
from Hen,HenType,HenStatus,HenUsageType,Building
where HenTypeId = HenType.Id and UsageTypeId = HenUsageType.Id and HenStatusId = HenStatus.Id and HouseId = Building.BuildingId

Select * From HenInfo where  HenTypeName = N'رسمی'
Select * From HenInfo where  HenTypeName = N'محلی'

/*____________ItemInfo_____________*/

Create View ItemInfo
as
Select 
Item.name as ItemName,
ItemType.name as ItemTypeName,
Unit.name as UnitName,
Item.CapacityUsage
from Unit,Item,ItemType
where Item.Itemtype = ItemType.Id and Item.UnitId = Unit.Id

Select * From ItemInfo 


/*بررسی اطلاعات سبد خرید*/
Select * From CartInfo where DoneHistory = '1397/3/3'

/*____________BuildingInfo_____________*/

Create View BuildingInfo
as Select 
Building.name as BuildingName,
telephone,
PlaceAddress, 
City.name as CityName, 
Buildingtype.name as BuildingTypeName, 
CurrentCapacity,
MaxCapacity,
BuildingId
From Building,BuildingType,City
where BuildingTypeId =  BuildingType.Id and Building.CityId = City.cityId




/*_______________Search Functions___________*/

Create Function SearchCart(@DoneHistory nvarchar(50))
returns @result table (ItemName nvarchar(50) ,ItemType nvarchar(50),Number float,Unit nvarchar(50),CapacityUsage int,OperationId nvarchar(50) ,DoneHistory nvarchar(50),BarnId nvarchar(50))
as
begin
Insert Into @result
Select * from CartInfo where DoneHistory = @DoneHistory
return
end
go


/*جستجو برای یافتن نام کارمندان*/

Create Function SearchName(@username nvarchar(50),@lastname nvarchar(50),@age int,@gender nvarchar(50),@telephone nvarchar(50),@homeAddress nvarchar(50),@EmployerId nvarchar(50),@citynme nvarchar(50))
returns @result table (name nvarchar(50) , lastname nvarchar(50), age int,gender nvarchar(50),telephone nvarchar(50),homeAddress nvarchar(50),EmployerId nvarchar(50),citynme nvarchar(50))
as
begin
Insert Into @result
Select name,lastname,age,gender,telephone,homeAddress,EmployerId,cityname 
from EmployerInfo 
where name = @username and lastname = @lastname and age = @age and gender = @gender and telephone = @telephone and homeAddress = @homeAddress and EmployerId = @EmployerId and cityname = @citynme
return
end
go

Select * From SearchName(N'عفت',N'اسفندیاری',27,N'زن',21226677888,N'بازار، خیابان 15 خرداد غربی، بین چهارراه گلوبندک و ابوسعید، پلاک 681',138739726,N'تهران')












exec Update_Hen '1377/1/6',1,'',1,1,3,1


select * from BuildingEdit


/*اطلاعات کارمندان*/
Create View EmployerInfo
as
Select Employer.name,
Employer.lastname,
Employer.age,
Employer.gender,
Employer.telephone,
Employer.homeAddress,
Employer.pass,
Employer.EmployerId,
City.name as cityname
from Employer,City
where Employer.CityId = City.cityId




exec Update_Employer 'A','A', 'A', 20, 'A','', '', 1, 1 


/*Insert Into Employer Values('Name','LName','Pass','Age','Phone','Address','ID','CityId')*/
Insert Into Employer Values(N'Ali',N'Saberi',001,23,'0253774',N'قم- خيابان صفائيه-جنب بيت مقام معظم رهبري',037142,10)


Insert Into Product Values('Egg',20,100)
Insert Into Product Values('Meat',20,101)



/*چک کردن موجود بودن کارمندان*/

Create Function IsAvailable(@TableName,@Id int)
returns int
as 
begin
declare @result int
Select @result = COUNT(*) From @TableName where @Id = EmployerId
return @result;
end
go

Create Function GetUnit(@ItemName nvarchar(50))
returns nvarchar(50)
as
begin
declare @GetUnitID int
Select @GetUnitID = UnitId From Item where @ItemName = name
declare @result nvarchar(50)
Select @result = name From Unit where Id = @GetUnitID
return @result;
end 
go

DECLARE @ReturnValue nvarchar(50)

EXEC @ReturnValue =  GetUnit N'ذرت'

Select @ReturnValue


Create Function GetCapacity(@ItemName nvarchar(50))
returns int
as
begin
declare @result int
Select @result = CapacityUsage From Item where name = @ItemName
return @result;
end 
go



/*چک کردن برای لاگین شدن کارمندان*/

Create Function IsLogin(@username nvarchar(50),@password nvarchar(50))
returns int
as
begin
declare @result int
Select @result = COUNT(*) From Employer where name = @username and pass = @password;
return @result;
end
go

Select a = COUNT(*) From Employer where EmployerId = '552280435';








Create Function SearchBuildingName(@BuildingName nvarchar(50))
returns @result table (name nvarchar(50),telephone nvarchar(50) , PlaceAddress nvarchar(200) ,CityName nvarchar(50),BuildName nvarchar(50),CurrentCapacity int,MaxCapacity int,BuildingId int)
as
begin 
Insert Into @result
Select * from BuildingInfo where BuildingName = @BuildingName
return
end
go

select * from Building where name = N'مجتبي'
select * from BuildingInfo where BuildingName = N'مجتبي'

Create Function SearchHen(@HenTypeName nvarchar(50))
returns @result table(BirthHistory nvarchar(50) ,HenTypeName nvarchar(50),HouseName nvarchar(50),UsageTypeName nvarchar(50),HenWeight float,HenStatusName nvarchar(50),HenId int)
as
begin
Insert Into @result
Select BirthHistory,HenTypeName,HouseName,HenUsageTypeName,HenWeight,HenStatusName,HenId from HenInfo where HenTypeName = @HenTypeName
return
end
go























